Repository: sheilagomes/wp-trad
Catalog: tm/GNOME_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: Are you sure you want to debug a program not using the Debug configuration? When optimizations are enabled, the debugger cannot always identify the source code corresponding to the instructions, so some commands can perform in a strange way, especially steps.
pt_br: Você tem certeza que você quer depurar um programa sem usar a configuração de Depuração ? Quando otimizações estão habilitadas, o depurador nem sempre consegue identificar o código fonte corresponde às instruções, e alguns comandos podem se comportar de maneira estranha, especialmente passos.

source: Add Breakpoint…
pt_br: Adicionar ponto de interrupção...

source: _Go to address
pt_br: Ir para endereço

source: Running…
pt_br: Executando...

source: _Debug Process…
pt_br: _Depurar o processo...

source: Debug _Remote Target…
pt_br: Depurar alvo _remoto...

source: Add source paths…
pt_br: Adicionar diretórios fonte...

source: Debugger Command…
pt_br: Comando do depurador

source: Show shared library mappings
pt_br: Mostra mapeamentos de bibliotecas compartilhadas

source: Single step out of function
pt_br: Dá um passo para sair da função

source: Unable to find a debugger plugin supporting a target with %s MIME type
pt_br: Não foi possível localizar um plug-in do depurador com suporte a um alvo com o tipo mime %s

source: Unable to detect MIME type of %s. Debugger cannot start.
pt_br: Não foi possível detectar o tipo mime de %s. O Depurador não pode ser iniciado.

source: Ins_pect/Evaluate…
pt_br: Inspecionar/Avaliar

source: Add Watch…
pt_br: Adicionar observação

source: _Go to
pt_br: I_r para

source: Rename
pt_br: Renomear

source: Save _As…
pt_br: Salvar _como...

source: _Print…
pt_br: Imprimir

source: Preview the current file in print format
pt_br: Visualiza o arquivo atual formatado para impressão

source: Convert End Of Line characters to the most common EOL found in the file
pt_br: Converte caracteres Fim de Linha para o tipo mais comum de Fim de Linha localizado no arquivo

source: _Line Number…
pt_br: _Linha número...

source: Go to previous history
pt_br: Vai para o histórico anterior

source: Go to next history
pt_br: Vai para o próximo histórico

source: _Auto-Complete
pt_br: _Completar automaticamente

source: Auto-complete the current word
pt_br: Completa automaticamente a palavra atual

source: Go to
pt_br: Ir para

source: Search for "%s" reached the end and was continued at the top.
pt_br: A pesquisa por "%s" chegou ao fim e recomeçou do início.

source: Search for "%s" reached the end and was continued at the top but no new match was found.
pt_br: A pesquisa por "%s" chegou ao fim e recomeçou do início mas nenhuma nova ocorrência foi encontrada.

source: No recently used resource found with URI "%s"
pt_br: Não foi localizado qualquer recurso usado recentemente com o URI "%s"

source: Cannot open "%s". %s
pt_br: Não foi possível abrir "%s". %s

source: Cannot open "%s". There is no plugin, default action, or application configured to handle this file type. MIME type: %s You may choose to try opening it with the following plugins or applications.
pt_br: Não foi possível abrir "%s". Não existe nenhum plug-in, ação padrão, ou aplicativo configurado para manipular este tipo de arquivo. Tipo MIME: %s. Você pode escolher tentar abri-lo com os plug-ins ou aplicativos a seguir.

source: Hypertext markup files
pt_br: Arquivos de mark-up de hipertexto

source: Shell script files
pt_br: Arquivos de script shell

source: _Open…
pt_br: _Abrir...

source: Base URI
pt_br: URI de base

source: URI of the top-most path displayed
pt_br: Uri do topo do caminho mostrado

source: Lisp Module
pt_br: Módulo Lisp

source: Generic rule
pt_br: Regra genérica

source: Extra target
pt_br: Alvo extra

source: Configure file
pt_br: Configurar arquivo

source: Interface file
pt_br: Arquivo de Interface

source: Intl rule
pt_br: Regra de Intl

source: Advanced…
pt_br: Avançado...

source: Getting ready to start debugging session…
pt_br: Preparando para iniciar a sessão de depuração...

source: Attaching to process: %d…
pt_br: Anexando ao processo: %d...

source: Detaching the process…
pt_br: Desanexando o processo...

source: Failed to create FIFO file named %s. The program will run without a terminal.
pt_br: Falha ao criar arquivo fifo de nome %s. O programa não executará em um terminal.

source: Retrieving status…
pt_br: Obtendo status...

source: Select a Folder
pt_br: Selecionar uma pasta

source: Add signed-off-by line
pt_br: Adiciona aprovados por linha

source: Git: Fetching…
pt_br: Git: trazendo...

source: Git: Retrieving log…
pt_br: Git: recuperando o log...

source: Git: Pushing…
pt_br: Git: Fazendo push...

source: _Stash uncommitted changes…
pt_br: Fazer _stash das alterações sem commit

source: _Apply stashed changes…
pt_br: _Aplicar alterações no stash

source: _View log…
pt_br: _Ver log...

source: _Add…
pt_br: _Adicionar

source: _Remove…
pt_br: _Remover

source: _Ignore…
pt_br: _Ignorar...

source: _Check out files…
pt_br: _Fazer checkout dos arquivos...

source: _Unstage files…
pt_br: _Fazer unstage de arquivos...

source: _Resolve conflicts…
pt_br: _Resolver conflitos...

source: Create patch series…
pt_br: Criar uma série de patches

source: _Apply…
pt_br: _Aplicar...

source: _Create branch…
pt_br: _Criar branch...

source: _Delete branch…
pt_br: _Excluir branch...

source: _Switch to another branch…
pt_br: _Alterna para outro branch...

source: _Merge…
pt_br: Mesclar...

source: _Start…
pt_br: _Iniciar...

source: _Delete…
pt_br: Excluir

source: _Create tag…
pt_br: _Criar etiqueta...

source: _Delete tag…
pt_br: Excluir etiquetas

source: _Reset tree…
pt_br: _Restaurar árvore...

source: _Revert commit…
pt_br: _Reverter o commit...

source: No associations initialized: nothing to save
pt_br: Nenhuma associação inicializada, nada para salvar

source: Unknown editor language "%s"
pt_br: Erro desconhecido no módulo "%s"

source: Couldn't find signal information
pt_br: Não foi possível encontrar uma informação de sinal

source: Associations dialog…
pt_br: Diálogo de associações...

source: Versioning…
pt_br: Versionando...

source: Invalid Glade file name
pt_br: Nome de arquivo glade inválido

source: You need to select a to-do item before you can remove it
pt_br: Você deve selecionar uma tarefa antes que você possa removê-la

source: Are you sure you want to remove the selected to-do item?
pt_br: Você tem certeza de que deseja remover a tarefa selecionada?

source: Are you sure you want to remove all the completed to-do items?
pt_br: Você tem certeza de que deseja remover todas as tarefas completadas?

source: Are you sure you want to remove all the completed to-do items in the category "%s"?
pt_br: Você tem certeza de que deseja remover todas as tarefas completadas na categoria "%s"?

source: Failed to parse XML structure
pt_br: Falha ao analisar a estrutura xml

source: Hide completed to-do items
pt_br: Ocultar tarefas completadas

source: Task manager
pt_br: Gerenciador de tarefas

source: Task manager view
pt_br: Gerenciador de tarefas

source: To-do Manager
pt_br: Gerenciador de tarefas

source: To-do List Preferences
pt_br: Preferências da lista de tarefas

source: Miscellaneous
pt_br: Miscelâneas

source: Auto-purge completed items
pt_br: Remove automaticamente as tarefas completadasPurge items after %d days

source: Auto-Purge
pt_br: Limpar automaticamente

source: Edit…
pt_br: Editar...

source: Press macro shortcut…
pt_br: Pressione a tecla de atalho da macro...

source: _Insert Macro…
pt_br: I_nserir Macro...

source: _Add Macro…
pt_br: _Adicionar macro...

source: Patching…
pt_br: Aplicando patch...

source: There are unfinished jobs: please wait until they are finished.
pt_br: Existem tarefas não concluídas, aguarde até elas serem concluídas.

source: Generation of project file failed. Cannot find an appropriate project template to use. Please make sure your version of Anjuta is up-to-date.
pt_br: Falha ao gerar o arquivo de projeto. Não foi possível localizar um modelo apropriado de projeto para utilizar. Por favor, certifique-se de que sua versão do Anjuta esteja atualizada.

source: Please select a project backend to open %s.
pt_br: Por favor selecione um backend de projeto para abrir %s.

source: Could not find a valid project backend for the given directory (%s). Please select a different directory, or try upgrading to a newer version of Anjuta.
pt_br: Não foi possível localizar um backend de projeto válido para o diretório fornecido (%s). Por favor, selecione um diretório diferente ou tente atualizar para uma nova versão do Anjuta.

source: Couldn't check out the supplied URI "%s". The error returned was: "%s"
pt_br: Não foi possível fazer check out do uri fornecido "%s". O erro recebido foi: "%s"

source: _Select file to add…
pt_br: Selecionar arquivo para adicionar...

source: Cannot add group
pt_br: Não foi possível adicionar o grupo

source: Cannot add target
pt_br: Não foi possível adicionar o alvo

source: Select sources…
pt_br: Escolher códigos-fonte...

source: Cannot add source files
pt_br: Não foi possível adicionar o código-fonte

source: No properties available for this group
pt_br: Nenhuma propriedade disponível para este grupo

source: Refreshing symbol tree…
pt_br: Atualizando a árvore de símbolos...

source: Are you sure you want to remove the following group from the project?
pt_br: Você tem certeza de que deseja remover o seguinte grupo do projeto?

source: Are you sure you want to remove the following target from the project?
pt_br: Você tem certeza de que deseja remover o seguinte alvo do projeto?

source: Are you sure you want to remove the following source file from the project?
pt_br: Você tem certeza de que deseja remover o seguinte arquivo fonte do projeto?

source: Are you sure you want to remove the following elements from the project?
pt_br: Você tem certeza de que deseja remover os seguintes elementos do projeto?

source: Group: %s
pt_br: Grupo: %s

source: Source: %s
pt_br: Fonte: %s

source: Shortcut: %s
pt_br: Atalho: %s

source: The group will not be deleted from the file system.
pt_br: O grupo não será excluído do sistema de arquivos.

source: The source file will not be deleted from the file system.
pt_br: O arquivo fonte não será excluído do sistema de arquivos.

source: Confirm remove
pt_br: Confirmar exclusão

source: Add _Group…
pt_br: Adicionar _grupo...

source: Add _Target…
pt_br: Adicionar al_vo

source: Add _Source File…
pt_br: Adicionar arquivo _fonte

source: _Add to Project
pt_br: Adicionar ao projeto

source: Created project view…
pt_br: Visualização do projeto criada...

source: Initializing Project…
pt_br: Inicializando o projeto...

source: Field "%s" must start with a letter, a digit or an underscore and contain only letters, digits, underscore, minus and dot. Please fix it.
pt_br: O campo "%s" deve começar por uma letra, um dígito ou sublinha (_) e conter apenas letras, dígitos, sublinha, hífen e ponto. Por favor corrija-o.

source: Field "%s" must start with a letter, a digit, an underscore or a directory separator and contain only letters, digits, underscore, directory separator, minus and dot. Please fix it.
pt_br: O campo "%s" deve começar por uma letra, um dígito ou sublinha (_) ou um separador de diretório e conter apenas letras, dígitos, sublinha, separador de diretório, hífen e ponto. Por favor corrija-o.

source: Install missing packages
pt_br: Instalando pacotes faltantes

source: The missing programs are usually part of some distrubution packages and can be searched for in your Application Manager. Similarly, the development packages are contained in special packages that your distribution provides to allow development of projects based on them. They usually end with a "-dev" or "-devel" suffix in package names and can be found by searching in your Application Manager.
pt_br: Os programas que estão faltando são, usualmente, parte de algum pacote de distribuição e podem ser pesquisados no seu Gerenciador de Aplicativos. Do mesmo modo, os pacotes de desenvolvimento estão contidos em pacotes especiais fornecidos por sua distribuição que permitem o desenvolvimento de projetos com base nela. Eles, de modo geral, terminam com sufixo -dev ou -devel nos nomes dos pacotes e podem ser localizados por intermédio do seu Gerenciador de Aplicativos.

source: Creating %s … Failed to create directory
pt_br: Criando %s ... Falha ao criar diretório

source: Creating %s (using AutoGen)… %s
pt_br: Criando %s (utilizando o AutoGen)... %s

source: Creating %s … %s
pt_br: Criando %s ... %s

source: A shared or a static library project
pt_br: Adicionar suporte a bibliotecas compartilhadas:

source: Build library as
pt_br: Compilar biblioteca como

source: Generic JavaScript
pt_br: JavaScript Genérico

source: Library
pt_br: Biblioteca

source: Only Shared
pt_br: Apenas Dinâmica

source: Only Static
pt_br: Apenas Estática

source: Select library type to build
pt_br: Escolha o tipo de biblioteca para compilar

source: Shared and Static library
pt_br: Biblioteca Estática e Compartilhada

source: Program Parameters…
pt_br: Parâmetros do programa

source: Set current program, arguments, etc.
pt_br: Defina o programa corrente, seus argumentos etc

source: _Find…
pt_br: _Localizar...

source: Find and R_eplace…
pt_br: Localizar e Su_bstituir...

source: Fin_d in Files…
pt_br: Lo_calizar nos arquivos...

source: Unable to build user interface for Search and Replace
pt_br: Não foi possível criar interface de usuário para Pesquisar e Substituir

source: The file "%s" on the disk is more recent than the current buffer. Do you want to reload it?
pt_br: O arquivo "%s" no disco é mais recente que o atualmente disponível no buffer. Deseja recarregá-lo?

source: The file "%s" has been deleted on the disk. Do you want to close it?
pt_br: O arquivo "%s" foi excluído do disco. Você deseja fechá-lo?

source: The file "%s" is read-only! Edit anyway?
pt_br: O Arquivo "%s" é somente leitura! Editar mesmo assim?

source: Enable autocompletion for document words
pt_br: Habilitar a completação automática de código

source: Print line numbers
pt_br: Imprimir número das linhas

source: GNOME Online API Documentation
pt_br: Documentação on-line da API do GNOME

source: Retrieving status……
pt_br: Obtendo status...

source: _Revert…
pt_br: _Reverter...

source: _Resolve Conflicts…
pt_br: _Resolver conflitos...

source: _Update…
pt_br: _Atualizar...

source: Syncronize your local copy with the Subversion tree
pt_br: Sincroniza sua cópia local com a árvore do Subversion

source: Copy Files/Folders…
pt_br: Copiar Arquivos/Pastas...

source: Switch to a Branch/Tag…
pt_br: Alternar para a versão/etiqueta...

source: Merge…
pt_br: Mesclar...

source: _View Log…
pt_br: _Ver log...

source: Copy…
pt_br: Copiar...

source: Subversion: Committing changes to the repository…
pt_br: Subversion: Enviando as mudanças para o repositório...

source: Subversion: Retrieving diff…
pt_br: Subversion: Obtendo diff...

source: Subversion: Retrieving log…
pt_br: Subversion: Obtendo log...

source: Subversion: Retrieving file…
pt_br: Subversion: Obtendo arquivo...

source: Go to symbol declaration
pt_br: Ir para declaração de símbolo

source: Go to symbol definition
pt_br: Ir para definição de símbolo

source: _Find Symbol…
pt_br: Localizar símbolo

source: %s: Generating inheritances…
pt_br: %s: Gerando heranças...

source: Generating inheritances…
pt_br: Gerando heranças...

source: Populating symbol database…
pt_br: Populando banco de dados de símbolos...

source: Loading…
pt_br: Carregando...

source: This option enables the default packages required by your opened project, e.g. Glib and GTK+ if you create a GTK+ project (may require more CPU work)
pt_br: Esta opção habilita os pacotes padrão necessários para seu projeto aberto, por exemplo: glib e gtk+ se você criar um projeto Gtk+ (pode precisar de mais trabalho de cpu)

source: This option means that the global system packages will be scanned simultaneously with the project's ones
pt_br: Esta opção significa que o sistema global de pacotes será lido ao mesmo tempo que os do projeto

source: Automatically update the file's symbols without saving. The update occurs after 10 seconds without keypresses by the user.
pt_br: Atualiza automaticamente os símbolos de arquivos sem salvar. A atualização acontece depois de 10 segundos sem o usuário apertar qualquer tecla.

source: Checking if package is parseable…
pt_br: Verificando se o pacote é analisável sintaticamente...

source: Use GNOME Terminal profile:
pt_br: Usar perfil do Terminal do GNOME:

source: _Variable…
pt_br: _Variável...

source: New accelerator…
pt_br: Novo acelerador...

source: Running command: %s…
pt_br: Executando comando: %s...

source: Unable to create a buffer: command aborted
pt_br: Não foi possível criar um buffer: comando abortado

source: No document currently open: command aborted
pt_br: Nenhum documento está aberto atualmente, comando abortado

source: Insert into buffer
pt_br: Inserir no buffer

source: Loaded Session…
pt_br: Sessão carregada...

source: About third-party Anjuta plugins
pt_br: Sobre os plug-ins do Anjuta criados por terceiros

source: Do not show the splash screen
pt_br: Não mostrar a tela de logotipo

source: Start a new instance and do not open the file in an existing instance
pt_br: Iniciar uma nova instância e não abrir o arquivo existente

source: Shut down Anjuta properly, releasing all resources (for debugging)
pt_br: Desligar o anjuta corretamente, liberando todos os recursos (para depuração)

source: GNOME toolbar setting
pt_br: Definições da barra de ferramentas do GNOME

source: Parenthesis indentation
pt_br: Recuo por parênteses

source: Auto-complete
pt_br: Completar automaticamente

source: Auto-Indent
pt_br: Recuo automático

source: Auto-indent current line or selection based on indentation settings
pt_br: Recua automaticamente a linha atual ou seleção com base nas configurações de recuo

source: Swap C header and source files
pt_br: Permuta entre o arquivo cabeçalho e o fonte

source: GNU Debugger Plugin
pt_br: Plug-in de depuração GNU.

source: Import an existing autotools project to Anjuta
pt_br: Importa um projeto autotools existente para o Anjuta

source: Project from Existing Sources
pt_br: Projeto a partir de código existente

source: GtkSourceView editor
pt_br: Editor GtkSourceView

source: The default editor based on GtkSourceView
pt_br: O editor padrão baseado no GtkSourceview

source: C++ and Java support plugin for code completion, auto-indentation, etc.
pt_br: Plug-in para completamento automático, recuo automático etc. dos códigos C++ e Java

source: Error: %s
pt_br: Erro: %s

source: Error: cant bind port
pt_br: Erro: não é possível realizar bind na porta

source: Anjuta JS Debugger Plugin
pt_br: Plug-in de depuração de JS do Anjuta

source: Javascript Debugger Plugin
pt_br: Plug-in de depuração Javascript

source: JS Support Plugin
pt_br: Plug-in de suporte a JS

source: JavaScript Support Plugin
pt_br: Plug-in de suporte a JavaScript

source: JS Find dirs
pt_br: Diretórios de busca do JS

source: Gir repository's directory:
pt_br: Diretório do repositório Git:

source: Gjs repository's directory:
pt_br: Diretório do repositório Gjs:

source: Min character for completion
pt_br: Número mínimo de caracteres para completar

source: Highlight missed semicolon
pt_br: Destaca os ponto-e-vírgulas faltantes

source: Add brace after function call autocompletion
pt_br: Adicionar uma chave ({) após autocompletar uma chamada de função

source: Tab position:
pt_br: Posição das tabulações:

source: Markup
pt_br: Marcação

source: Marked up text to render
pt_br: Texto a renderizar

source: Font description as a string
pt_br: Descrição da fonte (como um texto)

source: Font description
pt_br: Descrição da fonte

source: Font description as a PangoFontDescription struct
pt_br: Descrição da fonte (como uma estrutura PangoFontDescription)

source: Font family
pt_br: Nome da fonte

source: Name of the font family, e.g. Sans, Helvetica, Times, Monospace
pt_br: Ex: Times, Sans, Monospace

source: Font style
pt_br: Estilo da fonte

source: Font variant
pt_br: Variante da fonte

source: Font weight
pt_br: Espessura da fonta

source: Font stretch
pt_br: Elasticidade da fonte

source: Font size
pt_br: Tamanho da fonte

source: Font points
pt_br: Pontos da fonte

source: Font size in points
pt_br: Tamanho da fonte em pontos

source: Rise
pt_br: Elevação

source: Offset of text above the baseline (below the baseline if rise is negative)
pt_br: Deslocamento do texto acima da linha base (abaixo da linha base se a elevação for negativa)

source: Strikethrough
pt_br: Tachado

source: Whether to strike through the text
pt_br: Se o texto deve ser "riscado"

source: Underline
pt_br: Sublinhado

source: Style of underline for this text
pt_br: Linha abaixo do texto

source: Scale
pt_br: Escala

source: Size of font, relative to default size
pt_br: Tamanho da fonte, relativo ao tamanho padrão

source: Color
pt_br: Cor

source: Text color, as string
pt_br: Cor do texto, como uma string

source: Text color, as a GdkColor
pt_br: Cor do texto como um GdkColor

source: Text color, as an R/G/B/A combined integer
pt_br: Cor do texto, como um número inteiro combinação de R/G/B/A

source: Text width
pt_br: Largura do texto

source: Width of the rendered text
pt_br: Largura do texto renderizado

source: Text height
pt_br: Altura do texto

source: Height of the rendered text
pt_br: Altura do texto renderizado

source: Font family set
pt_br: Nome da fonte definido

source: Whether this tag affects the font family
pt_br: Se esta tag afeta a fonte

source: Font style set
pt_br: Estilo da fonte definido

source: Whether this tag affects the font style
pt_br: Se esta tag afeta o estilo da fonte

source: Font variant set
pt_br: Variação da fonte definida

source: Whether this tag affects the font variant
pt_br: Se esta tag afeta a variação da fonte

source: Font weight set
pt_br: Espessura da fonte definida

source: Whether this tag affects the font weight
pt_br: Se esta tag afeta a espessura da fonte

source: Font stretch set
pt_br: Elasticidade da fonte definida

source: Whether this tag affects the font stretch
pt_br: Se esta tag afeta a elasticidade da fonte

source: Font size set
pt_br: Tamanho da fonte definido

source: Whether this tag affects the font size
pt_br: Se esta tag afeta o tamanho da fonte

source: Rise set
pt_br: Elevação definida

source: Whether this tag affects the rise
pt_br: Se esta tag afeta a elevação

source: Strikethrough set
pt_br: Tachado definido

source: Whether this tag affects strikethrough
pt_br: Se esta tag afeta o tachado

source: Underline set
pt_br: Sublinhado definido

source: Whether this tag affects underlining
pt_br: Se esta tag afeta o sublinhado

source: Scale set
pt_br: Escala definida

source: Whether this tag affects font scaling
pt_br: Se esta tag afeta a escala

source: Args: %s
pt_br: Argumentos: %s

source: _Continue/Suspend
pt_br: _Continuar/Suspender

source: Continue or suspend the execution of the program
pt_br: Continua ou suspende a execução do programa

source: _Run from Cursor
pt_br: Executar a par_tir do cursor

source: Run from the cursor
pt_br: Executa a partir do cursor

source: Get Stack trace
pt_br: Ver pilha

source: Close Other
pt_br: Fechar os outros

source: Close other documents
pt_br: Fecha os outros documentos

source: Available pretty printers
pt_br: «Pretty printers» disponíveis

source: more children
pt_br: mais filhos
